
&НаСервере
Процедура ПересчитатьКоличествоПоГруппировкам(Идентификатор)
	
	Строка = ДеревоРабот.НайтиПоИдентификатору(Идентификатор);
	
	СтрокаРодитель = Строка.ПолучитьРодителя();       
	Если СтрокаРодитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущееРодительКоличество = СтрокаРодитель.Количество;
	
	НовоеРодительКоличество = СуммуКоличествоПодчиненных(СтрокаРодитель);
	
	Изменение = НовоеРодительКоличество - ТекущееРодительКоличество;
	
	СтрокаРодитель.Количество = НовоеРодительКоличество;
	
	СтрокаОбработки = СтрокаРодитель.ПолучитьРодителя();   
	Пока СтрокаОбработки <> Неопределено Цикл
		СтрокаОбработки.Количество = СтрокаОбработки.Количество + Изменение;
		СтрокаОбработки = СтрокаОбработки.ПолучитьРодителя();
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ДеревоРаботКоличествоПриИзменении(Элемент)
	
	Идентификатор = ТекущийЭлемент.ТекущаяСтрока;
	
	ПересчитатьКоличествоПоГруппировкам(Идентификатор);

КонецПроцедуры

Функция СуммуКоличествоПодчиненных(СтрокаРодитель)
	
	НовоеРодительКоличество = 0;
	Для каждого СтрокаПодчиненная Из СтрокаРодитель.ПолучитьЭлементы() Цикл
		НовоеРодительКоличество = НовоеРодительКоличество + СтрокаПодчиненная.Количество;
	КонецЦикла;
	
	Возврат НовоеРодительКоличество;
	
КонецФункции 
